project-git/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-29 Mon 23:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git</title>
<meta name="author" content="Adithya Nair" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc7cfe6">1. Starting With Some Motivation</a>
<ul>
<li><a href="#org9131592">1.1. The Problems It Solve</a></li>
<li><a href="#org41058a6">1.2. Usage In Industries</a></li>
</ul>
</li>
<li><a href="#org49d11db">2. How Git Works</a>
<ul>
<li><a href="#org576c541">2.1. The Three States</a></li>
<li><a href="#orgdf81cf0">2.2. <span class="todo TODO">TODO</span> A Time Machine</a></li>
<li><a href="#org49e7d14">2.3. <span class="todo TODO">TODO</span> A Glossary</a>
<ul>
<li><a href="#org6311b53">2.3.1. Repository</a></li>
<li><a href="#org5ed2ddf">2.3.2. Branches</a></li>
<li><a href="#org590c555">2.3.3. Commits</a></li>
</ul>
</li>
<li><a href="#org3df3342">2.4. We Will Be Using The CLI</a></li>
</ul>
</li>
<li><a href="#org34e0b05">3. Installation</a>
<ul>
<li><a href="#orgb9b602a">3.1. Linux</a></li>
<li><a href="#org3c3f26d">3.2. Mac</a></li>
<li><a href="#orgb373ce8">3.3. Windows</a></li>
</ul>
</li>
<li><a href="#org5fd6e63">4. Setup</a>
<ul>
<li><a href="#orgb83a179">4.1. Config</a></li>
</ul>
</li>
<li><a href="#org56e42fb">5. Commands</a>
<ul>
<li><a href="#org689bdd9">5.1. Initialize A Repo</a></li>
<li><a href="#org0ce1c19">5.2. Download A New Repo</a></li>
<li><a href="#orgbda3c2a">5.3. Commit</a></li>
<li><a href="#orge156639">5.4. Rollback Changes</a></li>
<li><a href="#orgb81377f">5.5. Create A New Branch</a></li>
<li><a href="#org7fb673b">5.6. Merge Branches</a></li>
<li><a href="#org5414040">5.7. Remote Repository Sync</a></li>
</ul>
</li>
<li><a href="#orge006f52">6. Example Workflow</a></li>
<li><a href="#orgcc77412">7. Community</a>
<ul>
<li><a href="#org63edaa4">7.1. Pull Requests</a></li>
<li><a href="#org58803bb">7.2. Discussions</a></li>
<li><a href="#orgbc84f02">7.3. Putting Up Issues</a></li>
</ul>
</li>
<li><a href="#orga451a33">8. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcc7cfe6" class="outline-2">
<h2 id="orgcc7cfe6"><span class="section-number-2">1.</span> Starting With Some Motivation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9131592" class="outline-3">
<h3 id="org9131592"><span class="section-number-3">1.1.</span> The Problems It Solve</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Version control solves two main problems.
</p>
<ol class="org-ol">
<li>You can confidently move forward in your projects, if you have saved states that you have annotated.</li>
<li>You can confidently work in teams, making changes to the projects independently.</li>
</ol>
</div>
</div>
<div id="outline-container-org41058a6" class="outline-3">
<h3 id="org41058a6"><span class="section-number-3">1.2.</span> Usage In Industries</h3>
</div>
</div>
<div id="outline-container-org49d11db" class="outline-2">
<h2 id="org49d11db"><span class="section-number-2">2.</span> How Git Works</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
&ldquo;When you do actions in Git, nearly all of them only add data to the Git database. It is hard to get the system to do anything that is not undoable or to make it erase data in any way.&rdquo; from Pro Git.
</p>
</blockquote>
</div>
<div id="outline-container-org576c541" class="outline-3">
<h3 id="org576c541"><span class="section-number-3">2.1.</span> The Three States</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Git has three main states:
</p>
<ol class="org-ol">
<li>Modified</li>
<li>Staged</li>
<li>Commited</li>
</ol>
</div>
</div>
<div id="outline-container-orgdf81cf0" class="outline-3">
<h3 id="orgdf81cf0"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> A Time Machine</h3>
</div>
<div id="outline-container-org49e7d14" class="outline-3">
<h3 id="org49e7d14"><span class="section-number-3">2.3.</span> <span class="todo TODO">TODO</span> A Glossary</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org6311b53" class="outline-4">
<h4 id="org6311b53"><span class="section-number-4">2.3.1.</span> Repository</h4>
</div>
<div id="outline-container-org5ed2ddf" class="outline-4">
<h4 id="org5ed2ddf"><span class="section-number-4">2.3.2.</span> Branches</h4>
</div>
<div id="outline-container-org590c555" class="outline-4">
<h4 id="org590c555"><span class="section-number-4">2.3.3.</span> Commits</h4>
</div>
</div>
<div id="outline-container-org3df3342" class="outline-3">
<h3 id="org3df3342"><span class="section-number-3">2.4.</span> We Will Be Using The CLI</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We will use the CLI only for the purposes of this workshop, and I highly suggest sticking with the CLI until you&rsquo;re familiar enough. Once you learn the CLI, you can use any GUI but you don&rsquo;t really learn the CLI from the GUI.
</p>
</div>
</div>
</div>
<div id="outline-container-org34e0b05" class="outline-2">
<h2 id="org34e0b05"><span class="section-number-2">3.</span> Installation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb9b602a" class="outline-3">
<h3 id="orgb9b602a"><span class="section-number-3">3.1.</span> Linux</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">sudo</span> &lt;package-manager&gt; install <span style="color: #f9e2af;">git</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3c3f26d" class="outline-3">
<h3 id="org3c3f26d"><span class="section-number-3">3.2.</span> Mac</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Mac users usually have it all installed anyway. Check by typing
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">git</span> --version
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">If not installed</span>
brew install <span style="color: #f9e2af;">git</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb373ce8" class="outline-3">
<h3 id="orgb373ce8"><span class="section-number-3">3.3.</span> Windows</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-nil">choco install git
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5fd6e63" class="outline-2">
<h2 id="org5fd6e63"><span class="section-number-2">4.</span> Setup</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb83a179" class="outline-3">
<h3 id="orgb83a179"><span class="section-number-3">4.1.</span> Config</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Setup your name and email. This is how git commits will be seen, so that we know who is responsible for what work clearly. (This will come in handy with git blame)
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">git</span> config --global user.name <span style="color: #a6e3a1;">"Adithya Nair"</span>
<span style="color: #f9e2af;">git</span> config --global user.email <span style="color: #a6e3a1;">"adithyanair121@gmail.com"</span>
</pre>
</div>
<p>
Setup your editor of choice
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6c7086;"># </span><span style="color: #6c7086;">For VS Code</span>
<span style="color: #f9e2af;">git</span> config --global core.editor <span style="color: #a6e3a1;">"code --wait"</span>
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">For Emacs</span>
<span style="color: #f9e2af;">git</span> config --global core.editor emacs
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">For NeoVim</span>
<span style="color: #f9e2af;">git</span> config --global core.editor <span style="color: #a6e3a1;">"nvim -f"</span>
</pre>
</div>
<p>
You might be wondering why I am adding the `&#x2013;wait` to vscode, that&rsquo;s because it allows VS Code to wait for a signal from git. This will come in handy later.
</p>
</div>
</div>
</div>
<div id="outline-container-org56e42fb" class="outline-2">
<h2 id="org56e42fb"><span class="section-number-2">5.</span> Commands</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org689bdd9" class="outline-3">
<h3 id="org689bdd9"><span class="section-number-3">5.1.</span> Initialize A Repo</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">git</span> init
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ce1c19" class="outline-3">
<h3 id="org0ce1c19"><span class="section-number-3">5.2.</span> Download A New Repo</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><p>
Cloning means downloading the entire repository, including the history of the entire project
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">git</span> clone &lt;repository-url&gt;
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgbda3c2a" class="outline-3">
<h3 id="orgbda3c2a"><span class="section-number-3">5.3.</span> Commit</h3>
</div>
<div id="outline-container-orge156639" class="outline-3">
<h3 id="orge156639"><span class="section-number-3">5.4.</span> Rollback Changes</h3>
</div>
<div id="outline-container-orgb81377f" class="outline-3">
<h3 id="orgb81377f"><span class="section-number-3">5.5.</span> Create A New Branch</h3>
</div>
<div id="outline-container-org7fb673b" class="outline-3">
<h3 id="org7fb673b"><span class="section-number-3">5.6.</span> Merge Branches</h3>
</div>
<div id="outline-container-org5414040" class="outline-3">
<h3 id="org5414040"><span class="section-number-3">5.7.</span> Remote Repository Sync</h3>
</div>
</div>
<div id="outline-container-orge006f52" class="outline-2">
<h2 id="orge006f52"><span class="section-number-2">6.</span> Example Workflow</h2>
</div>
<div id="outline-container-orgcc77412" class="outline-2">
<h2 id="orgcc77412"><span class="section-number-2">7.</span> Community</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org63edaa4" class="outline-3">
<h3 id="org63edaa4"><span class="section-number-3">7.1.</span> Pull Requests</h3>
</div>
<div id="outline-container-org58803bb" class="outline-3">
<h3 id="org58803bb"><span class="section-number-3">7.2.</span> Discussions</h3>
</div>
<div id="outline-container-orgbc84f02" class="outline-3">
<h3 id="orgbc84f02"><span class="section-number-3">7.3.</span> Putting Up Issues</h3>
</div>
</div>
<div id="outline-container-orga451a33" class="outline-2">
<h2 id="orga451a33"><span class="section-number-2">8.</span> References</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=2sjqTHE0zok">MIT Lecture on Git.</a></li>
<li><a href="https://git-scm.com/book/en/v2">Pro Git, A comprehensive look into git.</a></li>
<li><a href="https://tbaggery.com/2008/04/19/a-note-about-git-commit-messages.html">A note about commit messages</a>-</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Adithya Nair</p>
<p class="date">Created: 2024-07-29 Mon 23:10</p>
</div>
</body>
</html>
